Revit 2026 API

# IntersectionResultXYZPoint Property

---

Point of intersection in local 3d coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ XYZPoint { get; }
```
```vb
Public ReadOnly Property XYZPoint As XYZ
	Get
```
```cpp
public:
property XYZ^ XYZPoint {
	XYZ^ get ();
}
```
```fsharp
member XYZPoint : XYZ with get
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace